# Pandas

In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [144]:
df = pd.DataFrame.from_records(data, index= labels)

#### 1. Вывести информацию о датафрейме.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
age         8 non-null float64
animal      10 non-null object
priority    10 non-null object
visits      10 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [14]:
df[0:3]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [16]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [38]:
df.iloc[[3, 4, 8], [1, 0]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [41]:
df.loc[df['visits'] > 3]

Empty DataFrame
Columns: [age, animal, priority, visits]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [42]:
df.loc[df['age'].isnull()]

   age animal priority  visits
d  NaN    dog      yes       3
h  NaN    cat      yes       1

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [43]:
df[(df.animal == 'cat') & (df.age < 3)]

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [44]:
df[(df.age >= 2 ) & (df.age <= 4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

#### 9. Измените возраст в строке 'f' на 1,5.

In [151]:
df.at['f','age'] = 1.5
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

#### 10. Рассчитать общее количество всех посещений.

In [71]:
df.visits.sum()

19

#### 11. Расчитайте суммарный возраст животных

In [72]:
df.age.sum()

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [82]:
df.loc['k', 'age'] = 5
df[df.index != 'k']

   age animal priority  visits
a  2.5    cat      yes     1.0
b  3.0    cat      yes     3.0
c  0.5  snake       no     2.0
d  NaN    dog      yes     3.0
e  5.0    dog       no     2.0
f  1.5    cat       no     3.0
g  4.5  snake       no     1.0
h  NaN    cat      yes     1.0
i  7.0    dog       no     2.0
j  3.0    dog       no     1.0

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [83]:
df.animal.value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [84]:
df.sort_values('age')

   age animal priority  visits
c  0.5  snake       no     2.0
f  1.5    cat       no     3.0
a  2.5    cat      yes     1.0
b  3.0    cat      yes     3.0
j  3.0    dog       no     1.0
g  4.5  snake       no     1.0
e  5.0    dog       no     2.0
k  5.0    NaN      NaN     NaN
i  7.0    dog       no     2.0
d  NaN    dog      yes     3.0
h  NaN    cat      yes     1.0

In [86]:

df.sort_values('visits')

   age animal priority  visits
a  2.5    cat      yes     1.0
g  4.5  snake       no     1.0
h  NaN    cat      yes     1.0
j  3.0    dog       no     1.0
c  0.5  snake       no     2.0
e  5.0    dog       no     2.0
i  7.0    dog       no     2.0
b  3.0    cat      yes     3.0
d  NaN    dog      yes     3.0
f  1.5    cat       no     3.0
k  5.0    NaN      NaN     NaN

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [95]:
df.replace('yes', 'Yes')

   age animal priority  visits
a  2.5    cat      Yes     1.0
b  3.0    cat      Yes     3.0
c  0.5  snake       no     2.0
d  NaN    dog      Yes     3.0
e  5.0    dog       no     2.0
f  1.5    cat       no     3.0
g  4.5  snake       no     1.0
h  NaN    cat      Yes     1.0
i  7.0    dog       no     2.0
j  3.0    dog       no     1.0
k  5.0    NaN      NaN     NaN

In [96]:
df.replace('no', 'No')

   age animal priority  visits
a  2.5    cat      yes     1.0
b  3.0    cat      yes     3.0
c  0.5  snake       No     2.0
d  NaN    dog      yes     3.0
e  5.0    dog       No     2.0
f  1.5    cat       No     3.0
g  4.5  snake       No     1.0
h  NaN    cat      yes     1.0
i  7.0    dog       No     2.0
j  3.0    dog       No     1.0
k  5.0    NaN      NaN     NaN

#### 16. В столбце «animal» измените записи «snake» на «python».

In [97]:
df.replace('snake', 'python')

   age  animal priority  visits
a  2.5     cat      yes     1.0
b  3.0     cat      yes     3.0
c  0.5  python       no     2.0
d  NaN     dog      yes     3.0
e  5.0     dog       no     2.0
f  1.5     cat       no     3.0
g  4.5  python       no     1.0
h  NaN     cat      yes     1.0
i  7.0     dog       no     2.0
j  3.0     dog       no     1.0
k  5.0     NaN      NaN     NaN

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [101]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df = df.drop_duplicates('A')
df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [132]:
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = list('abcdefghij'))
min_sum = 5;
mark = '';
df

,a,b,c,d,e,f,g,h,i,j
0,0.023715,0.853813,0.371471,0.392790,0.991665,0.325201,0.417430,0.244584,0.021941,0.615116
1,0.286268,0.701491,0.739254,0.579189,0.739121,0.433709,0.059003,0.227035,0.249699,0.094149
2,0.494769,0.912620,0.592003,0.498602,0.935201,0.028043,0.657486,0.703001,0.515311,0.338830
3,0.336277,0.991328,0.601413,0.847699,0.554118,0.684228,0.306318,0.550172,0.871824,0.381307
4,0.839494,0.608441,0.042239,0.642831,0.278182,0.721351,0.358611,0.478954,0.956962,0.549533

In [138]:
for i in 'abcdefghij':
    if(df.i.sum()<min_sum): 
        min_sum = df.i.sum()
        mark = i
print(mark)

a

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [139]:

df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
num = df.value.sum()/ df.value.count()
df = df.fillna(num)
df

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [140]:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df = df['From_To'].str.split('_', expand=True)
df.columns=['From','To']
df['From'] = df['From'].str.lower()
df['To'] = df['To'].str.lower()
df

       From         To
0    london      paris
1    madrid      milan
2    london  stockholm
3  budapest      paris
4  brussels     london